Repository: igorsimb/igorsimb.ru
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Log In
ru: Войти

source: Email address
ru: Адрес Email

source: Password
ru: Пароль

source: Log in
ru: Войти

source: Log Out
ru: Выйти

source: Sign Up
ru: Регистрация

source: Password (again)
ru: Пароль (повторно)

source: Sign up
ru: Зарегистрироваться

source: Name
ru: Имя

source: Subject
ru: Тема

source: Message
ru: Сообщение

source: Igor Simbirtsev's Personal Portfolio Page
ru: Персональная страница портфолио Игоря Симбирцева

source: About
ru: Обо мне

source: I'm Igor Simbirtsev, a Full Stack Web Developer
ru: Я Игорь Симбирцев, Full Stack веб-разработчик

source: I am a web developer based in Russia and I build websites to help bring companies' ideas to life. With many years of experience working in startups, I help convert a vision and an idea into meaningful and useful software products. Having the ability to transform requirements into useful applications helps me prioritize tasks, iterate fast and deliver faster. Let's see if we can work together on your next project.
ru: Я веб-разработчик из России, создаю сайты, чтобы воплощать идеи компаний в жизнь. Многолетний опыт работы в стартапах позволяет мне превращать видение и идеи в полезные и значимые программные продукты. Умение преобразовывать требования в полезные приложения помогает мне расставлять приоритеты, быстро итеративно работать и поставлять решения быстрее. Давайте посмотрим, сможем ли мы поработать вместе над вашим проектом.

source: Backend &amp; Full Stack Django Developer.
ru: Backend и Full Stack разработчик на Django.

source: I use Django Rest Framework for creating backend APIs. For full stack appliations I utilize libraries like <strong>HTMX</strong> and <strong>AlpineJS</strong> to make websites fast and interactive.
ru: Я использую Django Rest Framework для создания API для бэкенда. Для разработки Full Stack приложений я применяю библиотеки такие как <strong>HTMX</strong> и <strong>AlpineJS</strong>, чтобы сделать сайты быстрыми и интерактивными.

source: Name:
ru: Имя

source: Igor Simbirtsev
ru: Игорь Симбирцев

source: Age:
ru: Возраст:

source: City:
ru: Город:

source: Moscow, Russia
ru: Москва, Россия

source: Reveal
ru: Показать

source: Will open in a new tab
ru: Откроется в новой вкладке

source: Contact
ru: Контакты

source: Feel free to contact me any time
ru: Свяжитесь со мной в любое время

source: Location:
ru: Расположение:

source: Your Name
ru: Ваше имя

source: Your Email
ru: Ваш Email

source: Your message has been sent. Thank you!
ru: Ваше сообщение отправлено. Спасибо!

source: Send Message
ru: Отправить сообщение

source: Home
ru: Главная

source: Skills
ru: Навыки

source: Portfolio
ru: Портфолио

source: Blog
ru: Блог

source: I'm a
ru: Я

source: Django Developer, Python Programmer
ru: разработчик Django, программист на Python

source: Showcasing complete functional projects demonstrates what I can bring to the table. I built these project from the ground up to demonstrate my skills in front-end, back-end, security, and database development. Contact me to get a complete code walkthrough. Also, check out my
ru: Демонстрация завершенных функциональных проектов показывает, что я могу предложить. Я создал эти проекты с нуля, чтобы продемонстрировать свои навыки во фронтенд-, бэкенд-разработке, безопасности и работе с базами данных. Свяжитесь со мной, чтобы получить полный разбор кода. Также загляните на мою

source: github page
ru: страницу на GitHub

source: to see more projects.
ru: чтобы увидеть больше проектов.

source: More Details
ru: Подробнее

source: I am a creative problem solver. I use Python, Django, SQL, Bootstrap, HTML, CSS and JavaScript. I have highlighted my key technical skills that I will bring to your project
ru: Я творчески подхожу к решению проблем. Я использую Python, Django, SQL, Bootstrap, HTML, CSS и JavaScript. Я выделил свои ключевые технические навыки, которые могу применить в вашем проекте.

source: Python logo
ru: Логотип Python

source: Python Development
ru: Разработка на Python

source: I use Python on a daily basis to build websites. You can see examples of my work implementing Python in my projects section.
ru: Я ежедневно использую Python для создания веб-сайтов. Вы можете увидеть примеры моей работы с Python в разделе проектов.

source: Django logo
ru: Логотип Django

source: Django Full Stack Web Development
ru: Full Stack разработка на Django

source: I use one of the most popular and versatile frameworks to build websites. Django and MVC fit the bill for most projects. Visit my projects to see examples.
ru: Я использую одну из самых популярных и универсальных платформ для создания веб-сайтов. Django и MVC подходят для большинства проектов. Посетите мои проекты, чтобы увидеть примеры.

source: Front End logo
ru: Логотип Front End

source: Front End Development
ru: Разработка фронтенда

source: I use HTML, CSS and JavaScript to build attractive frontends for websites.
ru: Я использую HTML, CSS и JavaScript для создания привлекательных интерфейсов для веб-сайтов.

source: Bootstrap logo
ru: Логотип Bootstrap

source: Bootstrap Front End Design
ru: Дизайн фронтенда с использованием Bootstrap

source: The look and feel are very important elements to any project. I utilize Bootstrap 5 to bring an attractive design to your web projects.
ru: Внешний вид и дизайн — это важные элементы любого проекта. Я использую Bootstrap 5 для создания привлекательного дизайна ваших веб-проектов.

source: SQL logo
ru: Логотип SQL

source: Database Development
ru: Разработка баз данных

source: Database development is critical to most project. I am well versed in SQL development from queries to design.
ru: Разработка баз данных — это ключевой элемент большинства проектов. Я хорошо знаком с SQL-разработкой, от запросов до проектирования.

source: Docker logo
ru: Логотип Docker

source: Safer, faster development
ru: Более безопасная и быстрая разработка

source: When working as a part of a team, safety and speed are crucial. Docker helps smooth out this process.
ru: При работе в команде безопасность и скорость имеют решающее значение. Docker помогает упростить этот процесс.

source: EZ2Task Project
ru: Проект EZ2Task

source: Project information
ru: Информация о проекте

source: Category
ru: Категория

source: Task management
ru: Управление задачами

source: Project URL
ru: URL проекта

source: Note that project is hosted on a free service, so it make take around 15-30 seconds to spin up on the first load
ru: Обратите внимание, что проект размещён на бесплатном сервисе, поэтому его загрузка может занять 15-30 секунд при первом запуске.

source: Technologies
ru: Технологии

source: Task and project management app
ru: Приложение для управления задачами и проектами

source: It supports one as well as groups of users working on the same projects. Users can also have different access levels.
ru: Приложение поддерживает как одного пользователя, так и группы, работающие над одними и теми же проектами. Пользователи могут иметь разные уровни доступа.

source: Application is used to set up tasks and managing business projects. Main functions include:
ru: Приложение используется для создания задач и управления бизнес-проектами. Основные функции включают:

source: Registration and authentication
ru: Регистрация и аутентификация

source: Creating tasks and projects
ru: Создание задач и проектов

source: User settings
ru: Настройки пользователя

source: Creating a company
ru: Создание компании

source: Company tasks and user management
ru: Управление задачами компании и пользователями

source: Dashboard
ru: Панель управления

source: Visit Project
ru: Посетить проект

source: MP Monitor Project
ru: Проект MP Monitor

source: E-commerce
ru: Электронная коммерция

source: MP Monitor, a beautiful price parser for Wildberries
ru: MP Monitor — удобный парсер цен для Wildberries

source: Monitor Wildberries prices either by hand or automatically. Ability to set a schedule for checking prices and see history of changes with a beautiful chart.
ru: Отслеживайте цены на Wildberries вручную или автоматически. Возможность запланировать проверку цен и увидеть историю изменений в удобном графике.

source: Main features include:
ru: Основные функции включают:

source: Unfinished orders are saved to cookies for unregistered users
ru: Незавершённые заказы сохраняются в cookies для незарегистрированных пользователей

source: Demo functionality with one click
ru: Демо-функционал в один клик

source: Schedule price checking
ru: Планирование проверки цен

source: Modern and stylish interface
ru: Современный и стильный интерфейс

source: Price history chart
ru: График истории цен

source: Shows current average, max and min prices
ru: Показывает текущие средние, максимальные и минимальные цены

source: Online Store Project
ru: Проект Интернет-магазин

source: Tortiki Online Store
ru: Интернет-магазин Тортики

source: Tortiki
ru: Тортики

source: Tortiki, a beautiful e-commerce store
ru: Тортики — красивый интернет-магазин

source: Demo-admin available. Demo-admin can view orders, users, addresses as well as add new items, categories, decide on popular items/categories that are featured on the main store page.
ru: Демо-админ доступен. Демо-админ может просматривать заказы, пользователей, адреса, а также добавлять новые товары, категории и определять популярные товары/категории, которые отображаются на главной странице магазина.

source: A beautiful e-commerce application that cells delicious cakes. Main features include:
ru: Красивое приложение для интернет-магазина, продающего вкусные торты. Основные функции включают:

source: Demo-admin with access to its own admin-panel
ru: Демо-админ с доступом к собственной панели управления

source: Demo-admin can manage all aspects of the store, inclu
ru: Демо-админ может управлять всеми аспектами магазина, включая

source: View, edit and delete orders, items, categories
ru: Просмотр, редактирование и удаление заказов, товаров, категорий

source: Manage carousel (i.e. choose items/categories and text for it)
ru: Управление каруселью (т.е. выбор товаров/категорий и текста для неё)

source: Choose featured items/categories that are shown on the main store page
ru: Выбор рекомендуемых товаров/категорий, отображаемых на главной странице магазина

source: Shopping cart
ru: Корзина

source: Search feature
ru: Функция поиска

source: Email has been successfully sent
ru: Электронное письмо успешно отправлено

source: Something went wrong. Please try again.
ru: Что-то пошло не так. Пожалуйста, попробуйте снова.

source: Russian
ru: Русский

source: English
ru: Английский
